Revit 2024 API
ParameterTypeId.AnalyticalModelColumnBaseExtension Property
 "Base x Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalModelColumnBaseExtension { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModelColumnBaseExtension As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalModelColumnBaseExtension {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace